Autodesk.Revit.DB.FailureDefinition.IsResolutionApplicable(Autodesk.Revit.DB.FailureResolutionType)
Checks if the given resolution type is applicable to the failure.
type:
The resolution type to check.
Returns:
True if the given resolution type is applicable to the failure, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.FailureDefinition.HasResolutions
Checks if the FailureDefinition has at least one resolution.
Returns:
True if at least one resolution is defined in the FailureDefinition.
Since:
2011

Autodesk.Revit.DB.FailureDefinition.GetDefaultResolutionType
Retrieves the default resolution type for the failure.
Returns:
The Default resolution type for the failure.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
FailureDefinition does not have any resolutions.
Since:
2011

Autodesk.Revit.DB.FailureDefinition.GetResolutionCaption(Autodesk.Revit.DB.FailureResolutionType)
Retrieves the caption for a specific resolution type.
type:
The resolution type.
Returns:
The caption of the resolution.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Resolution of the type is not applicable to the failure.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
FailureDefinition does not have any resolutions.
Since:
2011

Autodesk.Revit.DB.FailureDefinition.GetApplicableResolutionTypes
Retrieves a list of resolution types applicable to the failure.
Returns:
The list of resolution types applicable to the failure.
Since:
2011

Autodesk.Revit.DB.FailureDefinition.GetDescriptionText
Retrieves the description text of the failure.
Remarks:
Retrieved description text for built-in Revit failures is localized.
The result may vary from the description text retrieved from the corresponding FailureMessage.
A failure definition contains a description string, that may have format specifiers like %s, and "sample" strings,
that will be used to resolve them. A FailureMessage will contain "specific" strings.
So, in the failure definition description "Cannot keep %s joined" will be converted into "Cannot keep Element joined" while
the description in actual FailureMessage will read "Cannot keep Walls joined" or "Cannot keep Beams joined"
Returns:
The description text.
Since:
2011

Autodesk.Revit.DB.FailureDefinition.SetDefaultResolutionType(Autodesk.Revit.DB.FailureResolutionType)
Sets the default resolution type for the failure.
Remarks:
If failure has multiple resolutions, one of them is designated as designated as the default resolution. The default resolution
is used by Revit failure processing mechanism to resolve failures automatically when applicable.
type:
The type of resolution to be used as default.
Returns:
The FailureDefinition.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Resolution of the type is not applicable to the failure.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
FailureDefinition does not have any resolutions.
Since:
2011

Autodesk.Revit.DB.FailureDefinition.AddResolutionType(Autodesk.Revit.DB.FailureResolutionType,System.String,System.Type)
Adds a type of possible resolution for the failure.
Remarks:
In order to inform Revit what failure resolutions can be possibly used with a given failure, a FailureDefinition must
contain a full list of resolution types applicable to the failure, including user-visible caption and runtime class of the
resolution. The number of resolutions is not limited. The first added resolution becomes the default resolution.
type:
Type of the resolution to add. The type of resolution can be used only once for the FailureDefinition.
caption:
A simple description of the resolution.
classOfResolution:
The runtime class of the resolution. Used to ensure that the actual FailureResoution object added to the instance of FailureMessage
belongs to an applicable class.
Returns:
The FailureDefinition.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The type has already been added as a resolution to the FailureDefinition.
-or-
The input classOfResolution is not a subclass of FailureResolution.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.FailureDefinition.CreateFailureDefinition(Autodesk.Revit.DB.FailureDefinitionId,Autodesk.Revit.DB.FailureSeverity,System.String)
Creates an instance of a FailureDefinition.
Remarks:
The newly created FailureDefinition will be added to the FailureDefinitionRegistry. Because FailureDefinition
could only be registered when Revit starting up, this function cannot be used after Revit has already started.
Throws InvalidOperationException if invoked after Revit start-up is completed.
id:
Unique identifier of the failure.
severity:
The severity of the failure. Cannot be FailureSeverity::None.
messageString:
A user-visible string describing the failure.
Returns:
The created FailureDefinition instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The id of failure definition is not valid.
-or-
The id of failure definition is already used to register another FailureDefinition.
-or-
The severity of failures cannot be FailureSeverity::None.
-or-
Message string is empty or contains invalid characters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.FailureDefinition.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FailureDefinition.Severity
The severity of the failure.
Since:
2011

Autodesk.Revit.DB.FailureDefinition
Defines persistent information about a failure.
Remarks:
Each failure that can be potentially posted in Revit must be based on a FailureDefinition object
that contains some persistent information about failure such as identity, severity,
basic description text, types of resolution and default resolution. Each FailureMessage, which
contains variable part of the information for a specific failure when it occurs, is created with a reference to a registered FailureDefinition.
In order to be able to post a failure, one must define and register it via FailureDefinition object during Revit Application startup.
Since:
2011